{
  "id": 4,
  "title": "The Mysterious Treasure Hunt of Forest Friends",
  "introduction": "Baby bear Popo and friends embark on a forest.",
  "data": [
    {
      "page": 1,
      "content": "In the deep forest, baby bear Popo decided to go treasure hunting with his friends. Everyone was excited, imagining where the treasure could be hidden as they began their adventure.",
      "nextPage": [2],
      "prevPage": 0
    },
    {
      "page": 2,
      "content": "Popo and his friends discovered a strange map under a large tree at the edge of the forest. The map showed two paths.",
      "nextPage": [3],
      "prevPage": 1
    },
    {
      "page": 3,
      "content": "Popo and his friends noticed one path was filled with sunlight, while the other was shrouded in fog. Popo asked his friends which path they should take.",
      "nextPage": [4, 5],
      "prevPage": 2
    },
    {
      "page": 4,
      "content": "Popo and his friends began walking along the sunlit path. At the end of the path, they found a sparkling flower field and discovered a secret key.",
      "nextPage": [6, 7],
      "prevPage": 3,
      "choice": "Shall we choose the sunny path?"
    },
    {
      "page": 5,
      "content": "Popo and his friends cautiously walked through the fog, being careful not to lose each other. They encountered a crow that posed a riddle.",
      "nextPage": [8, 9],
      "prevPage": 3,
      "choice": "Shall we choose the foggy path?"
    },
    {
      "page": 6,
      "content": "Popo was delighted to hold the secret key, but he wondered where it could be used. His friends believed the key could open a door hidden behind a large rock.",
      "nextPage": [10, 11],
      "prevPage": 4,
      "choice": "Shall we try using the key?"
    },
    {
      "page": 7,
      "content": "Popo and his friends decided to leave the key behind and explore another path. They discovered a hidden fish pond and met a mysterious creature.",
      "nextPage": [12, 13],
      "prevPage": 4,
      "choice": "Shall we explore the pond?"
    },
    {
      "page": 8,
      "content": "Popo and his friends put their heads together to solve the crow's riddle. After successfully solving it, the crow gifted them a special compass.",
      "nextPage": [14, 15],
      "prevPage": 5,
      "choice": "Shall we solve the riddle?"
    },
    {
      "page": 9,
      "content": "Popo and his friends were unable to solve the riddle, so they decided to look for another path. They found a mysterious forest sparkling with stars a bit further away.",
      "nextPage": [16, 17],
      "prevPage": 5,
      "choice": "Shall we go to the starry forest?"
    },
    {
      "page": 10,
      "content": "Popo used the key to open the door behind the large rock, revealing a treasure chest. Inside the chest were beautiful jewels and small gifts for the friends to share.",
      "nextPage": [18],
      "prevPage": 6,
      "choice": "Shall we open the treasure chest?"
    },
    {
      "page": 11,
      "content": "Popo decided not to use the key to examine the chest. Instead, the friends prepared for another adventure.",
      "nextPage": [19],
      "prevPage": 6,
      "choice": "Shall we not use the key?"
    },
    {
      "page": 12,
      "content": "Upon arriving at the pond, Popo and his friends greeted the shimmering fish in the water. The fish gifted them a sparkling little orb.",
      "nextPage": [20],
      "prevPage": 7,
      "choice": "Shall we accept the orb?"
    },
    {
      "page": 13,
      "content": "Popo and his friends decided to spend time with the fish, dancing in the water and building friendships with the new creatures.",
      "nextPage": [21],
      "prevPage": 7,
      "choice": "Shall we play with the fish?"
    },
    {
      "page": 14,
      "content": "With the compass in hand, Popo started to track the location of the treasure. The friends headed in the direction indicated by the compass.",
      "nextPage": [22],
      "prevPage": 8,
      "choice": "Shall we follow the compass?"
    },
    {
      "page": 15,
      "content": "Popo chose to leave the compass behind and select another path. They followed the sound of a large flute hanging in the trees.",
      "nextPage": [23],
      "prevPage": 8,
      "choice": "Shall we follow the sound of the flute?"
    },
    {
      "page": 16,
      "content": "In the starry forest, Popo and his friends discovered magical star dust. The star dust made the friends feel happy.",
      "nextPage": [24],
      "prevPage": 9,
      "choice": "Shall we touch the star dust?"
    },
    {
      "page": 17,
      "content": "Lost in the starry forest, Popo and his friends found their way home by following the stars in the sky.",
      "nextPage": [25],
      "prevPage": 9,
      "choice": "Shall we follow the stars?"
    },
    {
      "page": 18,
      "content": "Popo and his friends shared the treasure and celebrated their precious friendship. They realized that the time they spent together was more valuable than the treasure.",
      "nextPage": [],
      "prevPage": 10
    },
    {
      "page": 19,
      "content": "Popo and his friends decided to embark on a new adventure and set out to find another mysterious place in the forest.",
      "nextPage": [],
      "prevPage": 11
    },
    {
      "page": 20,
      "content": "Popo felt happy looking at the orb given by the fish. The orb made the friendship among the friends shine even brighter.",
      "nextPage": [],
      "prevPage": 12
    },
    {
      "page": 21,
      "content": "Through their time with the fish, Popo and his friends learned the value of their connection with nature. They learned how to help and protect one another.",
      "nextPage": [],
      "prevPage": 13
    },
    {
      "page": 22,
      "content": "Where the compass pointed, there was a hidden small cave. Popo and his friends discovered a mysterious light inside the cave.",
      "nextPage": [],
      "prevPage": 14
    },
    {
      "page": 23,
      "content": "Following the sound of the flute, Popo and his friends had a wonderful time with the singing birds in the trees.",
      "nextPage": [],
      "prevPage": 15
    },
    {
      "page": 24,
      "content": "After touching the star dust, Popo and his friends felt a dreamy happiness and deepened their friendship in the forest.",
      "nextPage": [],
      "prevPage": 16
    },
    {
      "page": 25,
      "content": "Under the starlight, Popo and his friends promised to meet again as they left the forest. They became the greatest treasures for each other.",
      "nextPage": [],
      "prevPage": 17
    }
  ]
}
